cheat/feature-notes.org
** Core Implementation
#+BEGIN_SRC emacs-lisp
;; Customization interface
(defcustom cheat-repo-root "~/emacstools/cheat/cheat-repo/"
  "Directory containing cheatsheet .org files."
  :type 'directory
  :group 'cheat
  :package-version '(cheat . "1.0"))

(defvar cheat--file-cache nil
  "Cached list of cheatsheet files.")
(defvar cheat--last-cache-time nil
  "Timestamp of last cache update.")
(defvar cheat-history nil
  "History of selected cheatsheets.")

(defun cheat--refresh-file-list ()
  "Refresh file cache if directory has changed."
  (when (or (not cheat--file-cache)
            (time-less-p cheat--last-cache-time
                         (nth 5 (file-attributes cheat-repo-root))))
    (setq cheat--file-cache
          (directory-files-recursively cheat-repo-root "\\.org$" nil))
    (setq cheat--last-cache-time (current-time))))

(defun cheat-select-info ()
  "Interactive cheatsheet selector with cached file list."
  (interactive)
  (cheat--refresh-file-list)
  (let* ((cheat-dir-abs (expand-file-name cheat-repo-root))
         (selected (completing-read
                    "Choose your reference: "
                    (mapcar (lambda (f) (file-relative-name f cheat-dir-abs))
                            cheat--file-cache)
                    nil t nil 'cheat-history)))
    (when selected
      (let ((qref-buf (get-buffer-create "*QUICK-REF*")))
        (with-current-buffer qref-buf
          (view-mode -1)
          (erase-buffer)
          (condition-case err
              (insert-file-contents (concat cheat-dir-abs selected))
            (error (message "Error loading cheatsheet: %s"
                            (error-message-string err))))
          (org-mode)
          (goto-char (point-min))
          (view-mode 1)
          (local-set-key (kbd "q") 'quit-window))
        (pop-to-buffer qref-buf)))))
#+END_SRC

