cheat/feature-notes.html
<div id="outline-container-org2727700" class="outline-3">
<h3 id="org2727700"><span class="section-number-3">1.1.</span> Core Implementation</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #656868;">;; </span><span style="color: #656868;">Customization interface</span>
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defcustom</span> <span style="color: #BF93C3;">cheat-repo-root</span> <span style="color: #86B187;">"~/emacstools/cheat/cheat-repo/"</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Directory containing cheatsheet .org files."</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #F28B86;">:type</span> <span style="color: #C7B299;">'</span><span style="color: #C7B299;">directory</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #F28B86;">:group</span> <span style="color: #C7B299;">'</span><span style="color: #C7B299;">cheat</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #F28B86;">:package-version</span> <span style="color: #C7B299;">'</span><span style="color: #635770;">(</span>cheat . <span style="color: #86B187;">"1.0"</span><span style="color: #635770;">))</span>
 
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defvar</span> <span style="color: #BF93C3;">cheat--file-cache</span> nil
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Cached list of cheatsheet files."</span><span style="color: #635770;">)</span>
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defvar</span> <span style="color: #BF93C3;">cheat--last-cache-time</span> nil
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Timestamp of last cache update."</span><span style="color: #635770;">)</span>
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defvar</span> <span style="color: #BF93C3;">cheat-history</span> nil
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"History of selected cheatsheets."</span><span style="color: #635770;">)</span>
 
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defun</span> <span style="color: #EA9847;">cheat--refresh-file-list</span> <span style="color: #635770;">()</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Refresh file cache if directory has changed."</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">when</span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">or</span> <span style="color: #635770;">(</span><span style="color: #635770;">not</span> cheat--file-cache<span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">time-less-p</span> cheat--last-cache-time
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span><span style="color: #635770;">(</span><span style="color: #635770;">nth</span> <span style="color: #F6F3E8; font-weight: bold;">5</span> <span style="color: #635770;">(</span><span style="color: #635770;">file-attributes</span> <span style="color: #BF93C3;">cheat-repo-root</span><span style="color: #635770;">))))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">setq</span> cheat--file-cache
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">directory-files-recursively</span> <span style="color: #BF93C3;">cheat-repo-root</span> <span style="color: #86B187;">"\\.org$"</span> nil<span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">setq</span> cheat--last-cache-time <span style="color: #635770;">(</span><span style="color: #635770;">current-time</span><span style="color: #635770;">))))</span>
   
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defun</span> <span style="color: #EA9847;">cheat-select-info</span> <span style="color: #635770;">()</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Interactive cheatsheet selector with cached file list."</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">interactive</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span>cheat--refresh-file-list<span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">let*</span> <span style="color: #635770;">((</span>cheat-dir-abs <span style="color: #635770;">(</span><span style="color: #635770;">expand-file-name</span> <span style="color: #BF93C3;">cheat-repo-root</span><span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span><span style="color: #635770;">(</span>selected <span style="color: #635770;">(</span><span style="color: #635770;">completing-read</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #86B187;">"Choose your reference: "</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">mapcar</span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">lambda</span> <span style="color: #635770;">(</span>f<span style="color: #635770;">)</span> <span style="color: #635770;">(</span><span style="color: #635770;">file-relative-name</span> f cheat-dir-abs<span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> cheat--file-cache<span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> nil t nil <span style="color: #C7B299;">'</span><span style="color: #C7B299;">cheat-history</span><span style="color: #635770;">)))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">when</span> selected
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">let</span> <span style="color: #635770;">((</span>qref-buf <span style="color: #635770;">(</span><span style="color: #635770;">get-buffer-create</span> <span style="color: #86B187;">"*QUICK-REF*"</span><span style="color: #635770;">)))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">with-current-buffer</span> qref-buf
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #BF93C3;">view-mode</span> <span style="color: #F6F3E8; font-weight: bold;">-1</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">erase-buffer</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">condition-case</span> err
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">insert-file-contents</span> <span style="color: #635770;">(</span><span style="color: #635770;">concat</span> cheat-dir-abs selected<span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">error</span> <span style="color: #635770;">(</span><span style="color: #635770;">message</span> <span style="color: #86B187;">"Error loading cheatsheet: %s"</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">error-message-string</span> err<span style="color: #635770;">))))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #EA9847;">org-mode</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">goto-char</span> <span style="color: #635770;">(</span><span style="color: #635770;">point-min</span><span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #BF93C3;">view-mode</span> <span style="color: #F6F3E8; font-weight: bold;">1</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">local-set-key</span> <span style="color: #635770;">(</span><span style="color: #635770;">kbd</span> <span style="color: #86B187;">"q"</span><span style="color: #635770;">)</span> <span style="color: #C7B299;">'</span><span style="color: #C7B299;">quit-window</span><span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">pop-to-buffer</span> qref-buf<span style="color: #635770;">)))))</span>
</pre>
</div>
</div>
</div>
