cheat/feature-notes.org
** Key Features
*** 1. Intelligent Caching
- Automatic cache refresh when directory changes
- Fast file listing for large repositories
- History tracking of selections

*** 2. Org-Mode Integration
- Syntax highlighting via ~org-mode~
- Proper heading navigation
- Support for Org markup features

*** 3. Safe Buffer Handling
- Dedicated ~*QUICK-REF*~ buffer
- Read-only view with ~view-mode~
- Clean buffer reset between uses

* Installation & Usage
** Basic Setup
#+BEGIN_SRC emacs-lisp
;; Sample configuration
(use-package cheat-system
  :load-path "~/emacstools/cheat/"
  :commands (cheat-select-info)
  :config
  (setq cheat-repo-root "~/my-cheatsheets/"))
#+END_SRC

** Keybindings
| Key | Command             | Description               |
|-----|---------------------|---------------------------|
| q   | ~quit-window~       | Close cheatsheet buffer   |
| n   | ~next-line~         | Navigate down            |
| p   | ~previous-line~     | Navigate up              |
| TAB | ~org-cycle~         | Fold/Unfold headings     |

* Customization
** Directory Structure Example
#+BEGIN_EXAMPLE
~/my-cheatsheets/
+-- elisp.org
+-- python.org
+-- git.org
#+END_EXAMPLE

** Configuration Options
#+BEGIN_SRC emacs-lisp
(setq cheat-repo-root "~/work/cheatsheets/")  ; Custom repository location
(setq-default view-read-only t)              ; Global view-mode settings
#+END_SRC

* Extension Ideas
** Search Integration
#+BEGIN_SRC emacs-lisp
(defun cheat-search ()
  "Search across all cheatsheets."
  (interactive)
  (let ((default-directory cheat-repo-root))
    (call-interactively #'consult-ripgrep)))
#+END_SRC

** Bookmark System
#+BEGIN_SRC emacs-lisp
(defvar cheat-bookmarks nil
  "List of bookmarked cheatsheet entries.")

(defun cheat-bookmark-add ()
  "Bookmark current cheatsheet."
  (interactive)
  (when-let ((name (buffer-name)))
    (add-to-list 'cheat-bookmarks name)
    (message "Bookmarked: %s" name)))
#+END_SRC

* Documentation
** Function Reference
| Function              | Description                          |
|-----------------------|--------------------------------------|
| ~cheat-select-info~   | Main entry point for cheatsheet lookup |
| ~cheat--refresh-file-list~ | Internal cache maintenance function |

** Variables
| Variable              | Purpose                              |
|-----------------------|--------------------------------------|
| ~cheat-repo-root~     | Root directory for cheatsheet files  |
| ~cheat-history~       | Selection history tracking           |
