cheat/feature-notes.html
<div id="outline-container-org2da309c" class="outline-3">
<h3 id="org2da309c"><span class="section-number-3">1.2.</span> Key Features</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org055b7c8" class="outline-4">
<h4 id="org055b7c8"><span class="section-number-4">1.2.1.</span> 1. Intelligent Caching</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Automatic cache refresh when directory changes</li>
<li>Fast file listing for large repositories</li>
<li>History tracking of selections</li>
</ul>
</div>
</div>
<div id="outline-container-org4b21a29" class="outline-4">
<h4 id="org4b21a29"><span class="section-number-4">1.2.2.</span> 2. Org-Mode Integration</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Syntax highlighting via <code>org-mode</code></li>
<li>Proper heading navigation</li>
<li>Support for Org markup features</li>
</ul>
</div>
</div>
<div id="outline-container-org6472cd5" class="outline-4">
<h4 id="org6472cd5"><span class="section-number-4">1.2.3.</span> 3. Safe Buffer Handling</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Dedicated <code>*QUICK-REF*</code> buffer</li>
<li>Read-only view with <code>view-mode</code></li>
<li>Clean buffer reset between uses</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org09df335" class="outline-2">
<h2 id="org09df335"><span class="section-number-2">2.</span> Installation &amp; Usage</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org437d4f1" class="outline-3">
<h3 id="org437d4f1"><span class="section-number-3">2.1.</span> Basic Setup</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #656868;">;; </span><span style="color: #656868;">Sample configuration</span>
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">use-package</span> cheat-system
<span style="color: #385e39a639a6;"> </span> <span style="color: #F28B86;">:load-path</span> <span style="color: #86B187;">"~/emacstools/cheat/"</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #F28B86;">:commands</span> <span style="color: #635770;">(</span><span style="color: #EA9847;">cheat-select-info</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #F28B86;">:config</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">setq</span> <span style="color: #BF93C3;">cheat-repo-root</span> <span style="color: #86B187;">"~/my-cheatsheets/"</span><span style="color: #635770;">))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org43e8ae7" class="outline-3">
<h3 id="org43e8ae7"><span class="section-number-3">2.2.</span> Keybindings</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">q</td>
<td class="org-left"><code>quit-window</code></td>
<td class="org-left">Close cheatsheet buffer</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left"><code>next-line</code></td>
<td class="org-left">Navigate down</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left"><code>previous-line</code></td>
<td class="org-left">Navigate up</td>
</tr>

<tr>
<td class="org-left">TAB</td>
<td class="org-left"><code>org-cycle</code></td>
<td class="org-left">Fold/Unfold headings</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org1d18097" class="outline-2">
<h2 id="org1d18097"><span class="section-number-2">3.</span> Customization</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org61c4d48" class="outline-3">
<h3 id="org61c4d48"><span class="section-number-3">3.1.</span> Directory Structure Example</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example" id="org8fea13b">
~/my-cheatsheets/
+-- elisp.org
+-- python.org
+-- git.org
</pre>
</div>
</div>
<div id="outline-container-orgdbde27f" class="outline-3">
<h3 id="orgdbde27f"><span class="section-number-3">3.2.</span> Configuration Options</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #635770;">(</span><span style="color: #8AC6F2;">setq</span> <span style="color: #BF93C3;">cheat-repo-root</span> <span style="color: #86B187;">"~/work/cheatsheets/"</span><span style="color: #635770;">)</span>  <span style="color: #656868;">; </span><span style="color: #656868;">Custom repository location</span>
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">setq-default</span> <span style="color: #BF93C3;">view-read-only</span> t<span style="color: #635770;">)</span>              <span style="color: #656868;">; </span><span style="color: #656868;">Global view-mode settings</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org69a6120" class="outline-2">
<h2 id="org69a6120"><span class="section-number-2">4.</span> Extension Ideas</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org450b1ee" class="outline-3">
<h3 id="org450b1ee"><span class="section-number-3">4.1.</span> Search Integration</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #635770;">(</span><span style="color: #8AC6F2;">defun</span> <span style="color: #EA9847;">cheat-search</span> <span style="color: #635770;">()</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Search across all cheatsheets."</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">interactive</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">let</span> <span style="color: #635770;">((</span><span style="color: #BF93C3;">default-directory</span> <span style="color: #BF93C3;">cheat-repo-root</span><span style="color: #635770;">))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">call-interactively</span> <span style="color: #C7B299;">#'</span><span style="color: #C7B299;">consult-ripgrep</span><span style="color: #635770;">)))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org13e83dd" class="outline-3">
<h3 id="org13e83dd"><span class="section-number-3">4.2.</span> Bookmark System</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #635770;">(</span><span style="color: #8AC6F2;">defvar</span> <span style="color: #BF93C3;">cheat-bookmarks</span> nil
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"List of bookmarked cheatsheet entries."</span><span style="color: #635770;">)</span>
 
<span style="color: #635770;">(</span><span style="color: #8AC6F2;">defun</span> <span style="color: #EA9847;">cheat-bookmark-add</span> <span style="color: #635770;">()</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #8b8d8d;">"Bookmark current cheatsheet."</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">interactive</span><span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #8AC6F2;">when-let</span> <span style="color: #635770;">((</span>name <span style="color: #635770;">(</span><span style="color: #635770;">buffer-name</span><span style="color: #635770;">)))</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">add-to-list</span> <span style="color: #C7B299;">'</span><span style="color: #C7B299;">cheat-bookmarks</span> name<span style="color: #635770;">)</span>
<span style="color: #385e39a639a6;"> </span> <span style="color: #385e39a639a6;"> </span> <span style="color: #635770;">(</span><span style="color: #635770;">message</span> <span style="color: #86B187;">"Bookmarked: %s"</span> name<span style="color: #635770;">)))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaa5f739" class="outline-2">
<h2 id="orgaa5f739"><span class="section-number-2">5.</span> Documentation</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd4824e0" class="outline-3">
<h3 id="orgd4824e0"><span class="section-number-3">5.1.</span> Function Reference</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>cheat-select-info</code></td>
<td class="org-left">Main entry point for cheatsheet lookup</td>
</tr>

<tr>
<td class="org-left"><code>cheat--refresh-file-list</code></td>
<td class="org-left">Internal cache maintenance function</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org36e35e8" class="outline-3">
<h3 id="org36e35e8"><span class="section-number-3">5.2.</span> Variables</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>cheat-repo-root</code></td>
<td class="org-left">Root directory for cheatsheet files</td>
</tr>

<tr>
<td class="org-left"><code>cheat-history</code></td>
<td class="org-left">Selection history tracking</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Your Name</p>
<p class="date">Created: 2025-02-04 Tue 14:36</p>
</div>
</body>
</html>
